[
	{
		"id": 1,
		"title": "Ultimate Fudgy Brownies",
		"description": "Super rich, moist brownies with the perfect fudgy texture. These brownies are dense, chocolatey, and absolutely irresistible.",
		"imageUrl": "/images/recipes/ultimate-fudgy-brownies.jpeg",
		"prepTime": "15 minutes",
		"cookTime": "25-30 minutes",
		"totalTime": "1 hour 15 minutes (includes cooling)",
		"servings": "16 brownies",
		"category": 0,
		"difficulty": 0,
		"dateAdded": "2025-05-17T00:00:00",
		"slug": "ultimate-fudgy-brownies",
		"tags": [
			"chocolate",
			"fudgy",
			"easy",
			"dessert"
		],
		"ingredients": [
			"225g (1 cup) unsalted butter",
			"2 tablespoons vegetable oil",
			"300g (1 1/2 cups) granulated sugar",
			"2 whole eggs + 1 egg yolk, room temperature",
			"1 1/2 teaspoons vanilla extract",
			"65g (3/4 cup) unsweetened cocoa powder",
			"63g (3/4 cup) all-purpose flour",
			"1/4 teaspoon salt",
			"130g (3/4 cup) chocolate, chopped (or chips)"
		],
		"instructions": [
			"Prep: Preheat oven to 175°C. Line 8x8 pan with baking paper, leaving overhang for easy removal.",
			"Melt: Microwave butter in 30-second intervals until melted. Immediately stir in oil and sugar. Let cool 5 minutes.",
			"Mix Wet: Beat in 2 eggs + 1 yolk one at a time, then vanilla. Mix until just combined.",
			"Add Dry: Sift cocoa powder, flour, and salt directly over wet ingredients. Fold gently until just combined - DO NOT OVERMIX. Fold in 3/4 of the chopped chocolate.",
			"Optional but recommended: Refrigerate batter 15 minutes for extra fudgy texture.",
			"Bake: Pour into pan and evenly distribute the remaining 1/4 of chopped chocolate on top. Bake 25-30 minutes. The top should be set but still glossy. A toothpick should come out with moist crumbs, not clean.",
			"Cool: Let cool in pan 30 minutes, then refrigerate for at least 1 hour before cutting for best results."
		],
		"tips": [
			"Don't Overmix: For extra fudgy brownies, don't overmix the batter once you add the flour",
			"Perfect Doneness: The slight sinking in the middle is normal and indicates fudgy texture",
			"Clean Cuts: Use a sharp knife and clean between cuts for neat squares",
			"Storage: Store in an airtight container at room temperature for up to 5 days",
			"Moisture Tip: Add a piece of bread to the container to maintain moisture if they start to dry out",
			"Quick Cooling: Freezer method - Cool for 20 mins at room temp, then 20 mins in the freezer if you're in a hurry"
		]
	},
	{
	"id": 2,
	"title": "New York Vanilla Cheesecake with Raspberry and Passion Fruit Topping",
	"description": "A rich, creamy New York-style cheesecake with a thick digestive biscuit base and stunning raspberry passion fruit set topping. Perfect for special occasions.",
	"imageUrl": "/images/recipes/new-york-vanilla-cheesecake-raspberry-passion-fruit.jpeg",
	"prepTime": "30 minutes",
	"cookTime": "55-60 minutes",
	"totalTime": "8+ hours (includes cooling and chilling)",
	"servings": "8-10 servings",
	"category": 0,
	"difficulty": 2,
	"dateAdded": "2026-01-22T00:00:00",
	"slug": "new-york-vanilla-cheesecake-raspberry-passion-fruit",
	"tags": ["cheesecake", "dessert", "berries", "passion-fruit", "baking", "new-york-style", "special-occasion", "make-ahead"],
	"ingredients": [
		"360g digestive biscuits",
		"145g unsalted butter, plus extra for greasing",
		"2½ tbsp caster sugar (or 40g)",
		"Pinch of salt",
		"560g full-fat cream cheese (2 × 280g packs), room temperature",
		"125g caster sugar",
		"2 tsp plain flour",
		"2 tsp cornflour",
		"1½ tsp vanilla extract",
		"2 large eggs, room temperature",
		"1 large egg yolk, room temperature",
		"190ml soured cream, room temperature",
		"300g fresh raspberries",
		"4-5 passion fruits",
		"80g caster sugar",
		"2 tbsp water",
		"11g powdered gelatine (1 packet)",
		"3 tbsp warm water (for blooming gelatine)"
	],
	"instructions": [
		"Position an oven shelf in the middle and heat oven to 180°C/160°C fan/gas 4. Line the base of a 20cm springform tin with baking parchment.",
		"Crush 360g digestive biscuits into fine crumbs. Melt 145g butter and stir in the crumbs, 2½ tbsp sugar and a pinch of salt. Press firmly into the tin base and bake for 12-15 minutes until lightly golden. Cool on a wire rack.",
		"Reduce oven to 160°C/140°C fan/gas 3. Ensure cream cheese, eggs and soured cream are at room temperature (crucial for smooth texture).",
		"Beat 560g cream cheese at medium-low speed for 3-4 minutes until smooth. Gradually add 125g sugar, scraping down the bowl twice.",
		"Mix in 2 tsp plain flour, 2 tsp cornflour and pinch of salt on low speed. Add 1½ tsp vanilla extract.",
		"Add 2 eggs one at a time, then the yolk, beating gently after each. Add 190ml soured cream and mix just until blended. Don't overbeat.",
		"Brush tin sides with melted butter. Place tin in a slow cooker liner bag (or use heavy-duty foil wrapping). Pour filling over base and smooth the top.",
		"Place wrapped tin in a roasting tin and pour boiling water halfway up the sides. Bake for 45-50 minutes until edges are set but centre has a slight wobble.",
		"Turn off oven and crack door open. Cool in oven for 1 hour, then at room temperature. Refrigerate for at least 4 hours or overnight.",
		"Run a thin knife around the edge and release the springform. Transfer to serving plate or leave on base.",
		"Cut 4-5 passion fruits in half and scoop out all the pulp, seeds and juice. Sprinkle 11g gelatine over 3 tbsp warm water and let bloom undisturbed for 5 minutes.",
		"Simmer 300g raspberries, passion fruit pulp, 80g sugar and 2 tbsp water for 5-8 minutes until raspberries break down and mixture thickens. Help to break up larger chunks with a wooden spoon.",
		"Remove from heat and stir in bloomed gelatine until completely dissolved. Strain through a fine sieve for smooth topping (or leave chunky for texture).",
		"Cool topping to room temperature (30-45 minutes), stirring occasionally. Pour into centre of cheesecake and spread outward, stopping 5mm from edge. Refrigerate 2-3 hours until set.",
		"To serve, run a hot knife under water, wipe dry, and cut neat slices. Clean knife between cuts."
	],
	"tips": [
		"Room temperature ingredients are absolutely crucial - cold cream cheese will be lumpy no matter how long you beat it. Remove dairy and eggs from fridge 2 hours before starting.",
		"Beat cream cheese thoroughly until smooth, but once eggs are added, mix gently just until combined. Over-beating causes cracks.",
		"Use a slow cooker liner bag for foolproof waterproofing in the water bath, or skip the water bath entirely and place a pan of water on the bottom oven rack instead.",
		"The centre should wobble like jelly when done - it continues to set as it cools. Don't overbake.",
		"Choose passion fruits that feel heavy and have wrinkled, dimpled skin - these are ripest and most flavourful.",
		"Blueberry variation: If you can't find passion fruit, use 200g raspberries + 200g blueberries instead. Add 3-4 tbsp lemon juice to replace the passion fruit's tartness, and reduce sugar to 60-70g.",
		"This cheesecake tastes even better the next day as flavours develop. Keeps well in the fridge for 3-5 days when covered.",
		"When spreading the topping, work from the centre outward and leave a 5mm border for a professional, neat finish."
	]
	},
	{
		"id": 3,
		"title": "Twice-Cooked Pork Belly with Sticky Glaze",
		"description": "Tender, juicy pork belly with layers of melt-in-your-mouth meat and soft fat, coated in a sweet, salty, and spicy Asian-inspired glaze. A restaurant-quality dish perfect served over rice.",
		"imageUrl": "/images/recipes/twice-cooked-pork-belly-sticky-glaze.jpeg",
		"prepTime": "15 minutes",
		"cookTime": "2 hours 20 minutes",
		"totalTime": "2 hours 35 minutes",
		"servings": "4-6 servings",
		"category": 1,
		"difficulty": 1,
		"dateAdded": "2026-01-21T00:00:00",
		"slug": "twice-cooked-pork-belly-sticky-glaze",
		"tags": [
			"asian",
			"pork",
			"sticky",
			"glazed",
			"chinese-inspired",
			"pork belly",
			"main dish",
			"rice bowl"
		],
		"ingredients": [
			"2 pounds (900g) thick pork belly rashers",
			"2 cups (480ml) chicken or vegetable stock",
			"2 tablespoons olive oil",
			"2 tablespoons dark soy sauce",
			"1 tablespoon hoisin sauce",
			"1 teaspoon lemongrass paste",
			"1 tablespoon runny honey",
			"1 teaspoon crushed ginger",
			"2 cloves garlic, minced",
			"1 teaspoon dried chili flakes (optional)",
			"1 tablespoon brown sugar",
			"1 tablespoon white wine vinegar",
			"Sesame seeds, for garnish (optional)",
			"Chopped spring onion, for garnish (optional)"
		],
		"instructions": [
			"Place pork belly rashers in a large pan with stock and bring to a boil over high heat.",
			"Reduce heat to low (barely simmering), cover with lid, and simmer gently for 2 hours. Top up with extra stock if needed.",
			"While the pork simmers, mix all glaze ingredients (soy sauce, hoisin sauce, lemongrass paste, honey, ginger, garlic, chili flakes, brown sugar, and vinegar) in a small bowl. Set aside.",
			"Remove cooked pork from stock and let cool until safe to handle. Cut into 1-inch pieces.",
			"Heat 2 tablespoons olive oil in a large frying pan over medium heat (5/10 on your stovetop).",
			"Add pork pieces in batches (don't overcrowd) and brown slowly on all sides, turning frequently with tongs, about 10-15 minutes per batch.",
			"Once all pork is browned, return all pieces to the pan (or transfer to a large pot).",
			"Pour the glaze over the pork, bring to a boil, then simmer for about 5 minutes, stirring frequently, until the glaze thickens and coats the pork.",
			"Serve immediately over rice with your choice of vegetables (broccoli and carrots recommended). Garnish with sesame seeds and chopped spring onion if desired."
		],
		"tips": [
			"The 2-hour simmer is crucial for tender meat - don't rush it! You can simmer the night before and refrigerate, then just brown and glaze when ready to serve.",
			"Look for thick pork belly rashers (sometimes labeled as Chinese pork belly ribs), not thin bacon-like slices.",
			"Take your time browning - gentle, slow browning develops the best flavor. The pork should sizzle gently, not aggressively.",
			"Can be stored in the refrigerator for up to 3 days. Reheat in microwave or frying pan until piping hot.",
			"To freeze: brown the pork, let cool, and freeze for up to 2 months. Defrost and add freshly prepared glaze when ready to serve."
		]
	},
	{
		"id": 4,
		"title": "Classic Lemon Meringue Pie",
		"description": "A stunning British classic with buttery shortcrust pastry, tangy lemon filling, and fluffy toasted meringue.",
		"imageUrl": "/images/recipes/lemon-meringue-pie.jpeg",
		"prepTime": "45 minutes",
		"cookTime": "35 minutes",
		"totalTime": "5 hours (includes chilling)",
		"servings": "8 slices",
		"category": 0,
		"difficulty": 2,
		"dateAdded": "2026-01-21T00:00:00",
		"slug": "classic-lemon-meringue-pie",
		"tags": [
			"lemon",
			"meringue",
			"pie",
			"dessert",
			"British",
			"citrus",
			"pastry",
			"baking"
		],
		"ingredients": [
			"155g plain flour",
			"½ teaspoon salt",
			"1 tablespoon caster sugar",
			"110g cold unsalted butter, cubed",
			"45-60ml ice-cold water",
			"250ml water",
			"100-120ml fresh lemon juice (about 3-4 lemons)",
			"1 tablespoon lemon zest",
			"50g cornflour",
			"300g caster sugar",
			"4 large egg yolks",
			"30g unsalted butter",
			"4 large egg whites (room temperature)",
			"½ teaspoon lemon juice or white vinegar",
			"100g caster sugar (for meringue)",
			"½ teaspoon vanilla extract"
		],
		"instructions": [
			"Make the pastry: Mix 155g plain flour, ½ teaspoon salt, and 1 tablespoon caster sugar. Rub in 110g cold butter until it resembles breadcrumbs. Add ice-cold water gradually until dough comes together. Wrap and chill for 30 minutes.",
			"Roll out pastry and line a 22cm pie dish. Trim leaving 1-2cm overhang, fold under and crimp on the rim. Prick base with a fork. Chill for 15-30 minutes.",
			"Preheat oven to 170°C fan. Line pastry with baking paper and fill with baking beans. Bake for 15 minutes, remove paper and beans, then bake 5-8 minutes more until golden. Cool completely.",
			"Make the filling: Grate zest from 3-4 lemons and juice to get 100-120ml. In a saucepan, whisk together 50g cornflour and 300g caster sugar. Mix 250ml water and lemon juice separately, then gradually whisk into cornflour mixture until smooth.",
			"Cook over medium heat, stirring constantly, until mixture reaches a full rolling boil. Reduce heat slightly and cook for 2 full minutes, stirring constantly. The mixture should be very thick.",
			"Remove from heat. Whisk 4 egg yolks in a bowl. Slowly add 4-5 tablespoons hot mixture to yolks, whisking constantly to temper. Pour warmed yolks back into saucepan.",
			"Return to medium heat and cook for 2 minutes, stirring constantly, until mixture returns to a gentle boil. Remove from heat and stir in 30g butter and lemon zest until butter melts. Pour hot filling into cooled pastry case and leave at room temperature.",
			"Make the meringue: Preheat oven to 160°C fan. In a clean, grease-free bowl, whisk 4 egg whites and ½ teaspoon lemon juice until soft peaks form. Add 100g sugar one tablespoon at a time, whisking well after each addition. Whisk in ½ teaspoon vanilla until stiff, glossy peaks form.",
			"Immediately spread meringue over hot lemon filling, ensuring it touches the pastry edge all around to seal. Create peaks and swirls with the back of a spoon.",
			"Bake at 160°C fan for 12-15 minutes until meringue is golden brown. Cool at room temperature for 1 hour, then refrigerate for 3-4 hours (or overnight) before slicing."
		],
		"tips": [
			"The 50g cornflour is critical - do not reduce this amount or the filling won't set properly",
			"Cook the cornflour mixture at a full boil for the full 2 minutes to activate the thickening power",
			"The filling must be hot when you add the meringue - this helps cook the bottom of the meringue and creates a better seal",
			"Ensure your bowl and whisk are completely grease-free when making meringue, or it won't whip properly",
			"Seal the meringue completely to the crust edges to prevent it shrinking away during baking",
			"The filling continues to firm up as it cools - allow the full 3-4 hours chilling time for clean slices",
			"Best eaten the day it's made, but will keep refrigerated for 2-3 days",
			"To prevent pastry shrinkage: chill the lined pastry case for at least 30 minutes before blind baking, and don't stretch the pastry when fitting it into the dish"
		]
	},
	{
		"id": 5,
		"title": "Classic Lemon Drizzle Cake",
		"description": "A moist, tangy lemon cake with a signature crunchy sugar-lemon drizzle topping. The perfect balance of sweet and citrus.",
		"imageUrl": "/images/recipes/example-placeholder.svg",
		"prepTime": "15 minutes",
		"cookTime": "45-50 minutes",
		"totalTime": "2 hours 15 minutes (includes cooling)",
		"servings": "8-10 slices",
		"category": 0,
		"difficulty": 0,
		"dateAdded": "2026-01-21T00:00:00",
		"slug": "classic-lemon-drizzle-cake",
		"tags": [
			"lemon",
			"cake",
			"dessert",
			"british",
			"citrus",
			"loaf",
			"teatime"
		],
		"ingredients": [
			"175g softened butter (at room temperature)",
			"175g caster sugar",
			"3 large eggs (at room temperature)",
			"175g self-raising flour",
			"Zest of 2 unwaxed lemons",
			"2 tablespoons milk (whole or semi-skimmed)",
			"Juice of 2 lemons (for drizzle)",
			"100g granulated sugar (for drizzle)"
		],
		"instructions": [
			"Preheat oven to 180°C/160°C fan/Gas 4. Line your loaf tin with parchment paper, leaving overhang for easy removal. Let oven preheat for at least 15 minutes.",
			"Cream butter and caster sugar together for 3-4 minutes until almost white and very fluffy. Scrape down bowl sides several times. This step is crucial for a light cake.",
			"Break eggs into a separate bowl first, then add to mixture one at a time with a spoonful of flour after each egg to prevent curdling. Mix until fully incorporated before adding the next egg.",
			"Zest your lemons, pressing firmly to get the oil-rich yellow part. Gently fold in remaining flour and lemon zest using a metal spoon or silicone spatula - don't overmix. Add milk to reach dropping consistency (batter falls slowly off spoon).",
			"Pour batter into lined loaf tin and level the surface. Place in middle of oven and bake for 45-50 minutes without opening the door for first 40 minutes. Test with skewer in multiple spots - it should come out clean.",
			"About 5 minutes before cake is done, roll your room-temperature lemons firmly on counter, then juice them. Mix lemon juice with 100g granulated sugar but do NOT dissolve - keep granules intact for crunchy top.",
			"As soon as cake comes out of oven, poke lots of holes all over the top with a skewer while still in tin. Make plenty of holes for maximum drizzle absorption.",
			"Slowly pour the lemon-sugar drizzle over hot cake, starting from middle and working outward. If it pools at edges, spoon it back over the top. Leave cake to cool completely in tin, uncovered, for 1-2 hours before removing using parchment paper."
		],
		"tips": [
			"Don't rush the creaming step - the more air you incorporate, the lighter your cake will be",
			"Use a flexible silicone spatula or metal spoon (not wooden) for folding to preserve air bubbles",
			"Make the drizzle just before the cake comes out - if sugar sits in lemon juice too long, it will dissolve and you won't get the crunchy top",
			"Never cover the cake while cooling - this would make the crunchy drizzle top go soft",
			"The cake actually tastes better the next day when flavors have developed",
			"Store in airtight container but don't press anything directly on the drizzle crust",
			"For extra lemon flavor, add 1/2 teaspoon lemon extract to the batter",
			"If you only have plain flour, add 2 teaspoons baking powder to make it self-raising",
			"Optional: Add 2-3 tablespoons poppy seeds for a lemon poppy seed variation",
			"If cake browns too quickly, cover loosely with foil for remaining cooking time"
		]
	},
	{
		"id": 6,
		"title": "Japanese Jiggly Cheesecake",
		"description": "A light, fluffy, and impossibly jiggly Japanese-style cheesecake with a delicate soufflé texture. This cloud-like dessert is less sweet than traditional cheesecake and melts in your mouth.",
		"imageUrl": "/images/recipes/japanese-fluffy-cheesecake-frui.jpeg",
		"prepTime": "30-45 minutes",
		"cookTime": "1 hour",
		"totalTime": "4.5-5.5 hours (includes cooling)",
		"servings": "8-10 servings",
		"category": 0,
		"difficulty": 2,
		"dateAdded": "2026-01-21T00:00:00",
		"slug": "japanese-jiggly-cheesecake",
		"tags": [
			"japanese",
			"cheesecake",
			"dessert",
			"baking",
			"souffle",
			"jiggly",
			"light",
			"fluffy"
		],
		"ingredients": [
			"280g Philadelphia cream cheese (room temperature)",
			"5 large eggs (separated into yolks and whites)",
			"60g butter",
			"120ml whole milk",
			"30g plain flour",
			"15g cornflour",
			"150g caster sugar"
		],
		"instructions": [
			"In a medium saucepan over medium heat, combine 120ml whole milk, 60g butter, and 280g cream cheese until smooth. Remove from heat and mix in 30g plain flour, 15g cornflour, and 5 egg yolks until well combined.",
			"In a large bowl, whisk 5 egg whites and 150g caster sugar until stiff peaks form. Ensure your bowl and whisk are completely grease-free for best results.",
			"Gently fold both mixtures together using a large metal spoon, folding from bottom up to preserve the air in the egg whites. Be careful not to knock out the air.",
			"Pour into an 8-inch springform tin lined tall with baking parchment. Make the parchment collar 5cm or more taller than your tin to allow for the soufflé rise.",
			"Place a roasting tin filled with hot water (2-3cm deep) on the bottom shelf of the oven. Place the cheesecake on the middle shelf.",
			"Bake at 175°C for 20 minutes, then reduce temperature to 150°C and bake for an additional 40 minutes. Do not open the oven door during baking.",
			"When done, turn off the oven and crack the door open slightly. Leave the cheesecake inside for 30-45 minutes to cool gradually and prevent cracking.",
			"Remove from oven and cool at room temperature for 1-2 hours, then refrigerate for at least 2 hours (or ideally overnight) before serving. The cheesecake will deflate as it cools - this is completely normal."
		],
		"tips": [
			"Use an oven thermometer to verify actual temperatures as electric ovens can be inaccurate by 20-30°C",
			"Room temperature egg whites whip faster and achieve better volume than cold ones",
			"The cheesecake will rise dramatically like a soufflé then deflate as it cools - this is expected and normal",
			"Run a thin knife around the edges after the first hour of cooling to prevent sticking",
			"For best texture and easier slicing, chill overnight before serving",
			"The cheesecake is quite rich on its own - serve with fresh berries or a dollop of sweetened mascarpone cream",
			"If cracks appear on top, dust with icing sugar or cover with berries to hide them",
			"Store covered in the fridge for up to 3-4 days"
		]
	},
	{
		"id": 7,
		"title": "Butter Chicken",
		"description": "A creamy, flavourful curry native to the UK that has won hearts worldwide with its rich tomato-based sauce and tender spiced chicken, perfect served with fresh basmati rice or naan.",
		"imageUrl": "/images/recipes/creamy-butter-chicken.jpeg",
		"prepTime": "30 minutes",
		"cookTime": "1 hour 15 minutes",
		"totalTime": "2 hours 45 minutes (includes marinating)",
		"servings": "4 servings",
		"category": 1,
		"difficulty": 1,
		"dateAdded": "2026-02-02T00:00:00",
		"slug": "butter-chicken",
		"tags": [
			"curry",
			"indian",
			"chicken",
			"creamy",
			"spicy",
			"comfort food",
			"dinner"
		],
		"ingredients": [
			"1 kg boneless chicken thighs, cut into bite-sized pieces",
			"500g full-fat yoghurt",
			"2 tablespoons garlic, ginger, and chilli paste",
			"1 tablespoon ground coriander",
			"1 tablespoon Kashmiri chilli powder",
			"2 tablespoons garam masala",
			"2 tablespoons ground turmeric",
			"2 tablespoons ground cumin",
			"2 pinches of salt",
			"3 tablespoons ghee or extra virgin olive oil",
			"2 red onions, finely chopped",
			"Half a cup of cashews",
			"3 garlic cloves",
			"2 thumb-sized pieces of ginger",
			"3 chillies",
			"1 can of chopped tomatoes",
			"2 black cardamom pods",
			"1 tablespoon whole cumin seeds",
			"1 star anise",
			"3 cloves",
			"5 green cardamom pods",
			"1 cinnamon stick",
			"2 bay leaves",
			"Salt to taste",
			"Sugar to taste",
			"Half a stick of butter (optional)",
			"1 handful of fresh coriander leaves",
			"1 tablespoon dried fenugreek leaves"
		],
		"instructions": [
			"Prepare the chicken marinade by chopping the chicken into bite-sized pieces. Blend 3 garlic cloves, 2 thumb-sized ginger pieces, and 3 chillies into a paste. Reserve half for the gravy. Mix the marinade ingredients together in a large bowl and refrigerate for 1 hour to overnight for best results.",
			"For oven method: Preheat oven to 190°C fan/170°C gas mark 5. Lay marinated chicken on a roasting tray in an even layer and roast for 45 minutes to 1 hour, checking occasionally to avoid burning.",
			"For pan-frying method: Heat 1 tablespoon of ghee/oil in a frying pan on medium heat. Lay chicken evenly and cook for 3 minutes without disturbing. Flip and repeat until each side is cooked with a nice char (6-7 minutes total). Keep the pan unwashed for the gravy.",
			"For the gravy, melt ghee/oil in a deep pot on medium-high heat. Cook the red onions until slightly golden brown on the edges.",
			"Add cashews and the remaining garlic-ginger-chilli paste. Cook until fragrant, about 2 minutes.",
			"Add the whole spices: black cardamom pods, cumin seeds, star anise, cloves, green cardamom pods, cinnamon stick, and bay leaves.",
			"Add all dried spices: chilli powder, garam masala, ground turmeric, and ground cumin. Reduce heat to medium-low and stir constantly to avoid burning.",
			"Pour in the canned tomatoes. Stir constantly on medium-low heat for 5-10 minutes to cook down the tomatoes and soften the cashews.",
			"Carefully blend the mixture until smooth. Add a little water if too dry, but no more than a quarter cup to keep the gravy thick and creamy.",
			"Return the gravy to the pot on low heat. Add salt and a pinch of sugar to taste.",
			"Add the cooked chicken to the pot, stir, and cook covered for 15 minutes on low heat, stirring occasionally.",
			"Add fresh coriander leaves and crush dried fenugreek leaves with your palms into the pot. Stir well before serving with basmati rice, naan, or both."
		],
		"tips": [
			"Marinating the chicken overnight gives the best flavour results.",
			"Don't wash the pan after cooking the chicken - use the same pan for the gravy to maximise flavour.",
			"The Maillard reaction (caramelisation) on the chicken adds depth of flavour, so don't skip the charring step.",
			"If using the oven method, spread the chicken in an even layer for consistent cooking.",
			"The gravy should be a rich orange colour with a smooth, creamy consistency."
		]
	},
	{
		"id": 8,
		"title": "Profiteroles",
		"description": "Classic French choux pastry puffs filled with vanilla whipped cream and drizzled with rich chocolate sauce.",
		"imageUrl": "/images/recipes/profiteroles.jpeg",
		"galleryImages": ["/images/recipes/profiteroles-cross-section.jpeg"],
		"prepTime": "30 minutes",
		"cookTime": "25-30 minutes",
		"totalTime": "1.5-2 hours (includes cooling)",
		"servings": "20-24 profiteroles (serves 4-6)",
		"category": 0,
		"difficulty": 2,
		"dateAdded": "2026-02-08T00:00:00",
		"slug": "profiteroles",
		"tags": ["chocolate", "cream", "french", "choux pastry", "dinner party", "impressive", "classic"],
		"ingredients": [
			"75g plain flour",
			"60g butter",
			"150ml water",
			"2 large eggs, beaten",
			"Pinch of salt",
			"300ml double cream",
			"1 tbsp icing sugar",
			"1 tsp vanilla extract",
			"150g dark chocolate",
			"150ml double cream (for sauce)",
			"25g butter (for sauce)"
		],
		"instructions": [
			"Preheat oven to 200°C (180°C fan) / Gas 6. Line two baking trays with baking paper.",
			"Put the 150ml water, 60g butter and pinch of salt in a medium saucepan over medium heat. Let the butter melt completely, then bring to a rolling boil.",
			"Remove from heat immediately. Tip in the 75g plain flour all at once and beat vigorously with a wooden spoon until the mixture forms a smooth ball that pulls away from the sides of the pan. This takes about a minute.",
			"Leave the dough to cool in the pan for 5 minutes — this stops the eggs scrambling when you add them.",
			"Gradually add the 2 beaten eggs, a little at a time, beating well after each addition. The mixture will look slippery and separated at first but keep beating and it will come together. Stop adding egg when the dough is smooth, glossy, and drops reluctantly from the spoon when you lift it. You may not need all the egg.",
			"Fit your piping bag with a plain round nozzle (about 1cm diameter). Fill the bag with the choux dough.",
			"Pipe blobs about 3-4cm in diameter onto your lined trays — they will roughly double in size to golf ball sized puffs. Leave about 5cm between each. If there are any peaks on top, wet your finger and gently pat them down.",
			"Bake for 25-30 minutes until deeply golden and crisp. Do not open the oven door during baking or they may collapse.",
			"Remove from oven. Pierce the base of each puff with a skewer or sharp knife to release the steam inside. Transfer to a wire rack and leave to cool completely.",
			"Pour the 300ml double cream into a large bowl. Add the 1 tbsp icing sugar and 1 tsp vanilla extract. Whip until the cream holds soft peaks. Don't over-whip or it will turn grainy.",
			"Fit a clean piping bag with a small round nozzle. Fill with the whipped cream. Pipe cream into each cooled puff through the hole in the base.",
			"Break the 150g dark chocolate into small pieces and place in a heatproof bowl. Heat the 150ml double cream in a small saucepan until just simmering, then pour over the chocolate. Leave for a minute, then stir gently until smooth.",
			"Add the 25g butter to the chocolate sauce and stir until melted and combined.",
			"Stack the filled profiteroles on a serving plate and drizzle generously with the warm chocolate sauce. Serve immediately."
		],
		"tips": [
			"Aim for golf ball sized puffs after baking — pipe them about 3-4cm diameter as they roughly double in size.",
			"The choux rises from steam, not yeast, so don't open the oven door early or they'll collapse.",
			"Unfilled puffs keep in an airtight container for a day, or freeze for up to a month and refresh in a hot oven for 5 minutes.",
			"Once filled with cream, eat within a few hours as they soften quickly.",
			"If you don't have a piping bag, two teaspoons work fine for shaping the choux — the results will just be more rustic."
		]
	}
]